[{"slug": "tests/plugins/test-post-model", "title": "test_post_model.py", "description": "None", "tags": []}, {"slug": "tests/plugins/test-redirects", "title": "test_redirects.py", "description": "Tests the redirects plugin", "tags": []}, {"slug": "tests/test-feeds", "title": "test_feeds.py", "description": "None", "tags": []}, {"slug": "markata/plugins/md-it-highlight-code", "title": "md_it_highlight_code.py", "description": "The plugin adds syntax highlighting to code blocks in your markdown content. It uses Pygments for highlighting and adds a copy button for easy code sharing.…", "tags": []}, {"slug": "markata/plugins/to-json", "title": "to_json.py", "description": "None", "tags": []}, {"slug": "markata/plugins/init", "title": "__init__.py", "description": "None", "tags": []}, {"slug": "markata/plugins/auto-description", "title": "auto_description.py", "description": "The plugin automatically generates descriptions for your posts by extracting text from the first paragraphs of your markdown content. It can create multiple…", "tags": []}, {"slug": "markata/plugins/covers", "title": "covers.py", "description": "The plugin generates custom cover images for your posts using configurable templates. It supports multiple cover image formats with different sizes, fonts,…", "tags": []}, {"slug": "markata/plugins/tui", "title": "tui.py", "description": "None", "tags": []}, {"slug": "markata/plugins/publish-source", "title": "publish_source.py", "description": "The plugin saves processed markdown files to the output directory, preserving frontmatter and content modifications. This enables source file access alongside…", "tags": []}, {"slug": "markata/plugins/jinja-env", "title": "jinja_env.py", "description": "Jinja2 Environment Plugin Provides a centralized Jinja2 environment configuration for consistent template rendering across all Markata plugins. This plugin…", "tags": []}, {"slug": "markata/plugins/load", "title": "load.py", "description": "The plugin is responsible for loading and parsing markdown files with frontmatter into Post objects. It provides parallel loading capabilities and handles…", "tags": []}, {"slug": "markata/plugins/generator", "title": "generator.py", "description": "The plugin adds a meta generator tag to each generated HTML page, indicating that the page was generated by Markata and including the version number.…", "tags": []}, {"slug": "markata/plugins/setup-logging", "title": "setup_logging.py", "description": "Setup Logging hook sets up the RichHandler for pretty console logs, and file logs to the configured markata's configured , or if is not configured. The log…", "tags": []}, {"slug": "markata/plugins/post-model", "title": "post_model.py", "description": "The plugin defines the core Post model used throughout Markata. It provides robust validation, serialization, and configuration options for all post…", "tags": []}, {"slug": "markata/plugins/publish-dev-to-source", "title": "publish_dev_to_source.py", "description": "The plugin enables synchronization between your Markata posts and dev.to articles. It handles frontmatter translation and content formatting for dev.to…", "tags": []}, {"slug": "markata/plugins/glob", "title": "glob.py", "description": "The plugin handles file discovery using glob patterns. It determines which files should be processed by Markata based on configured patterns. A glob is a…", "tags": []}, {"slug": "markata/plugins/service-worker", "title": "service_worker.py", "description": "Adds a service_worker to your site. This will make it installable on mobile, viewable offline, and potentially more responsive as the user goes between good…", "tags": []}, {"slug": "markata/plugins/subroute", "title": "subroute.py", "description": "None", "tags": []}, {"slug": "markata/plugins/skip", "title": "skip.py", "description": "Post Skipping and Caching Plugin", "tags": []}, {"slug": "markata/plugins/datetime", "title": "datetime.py", "description": "The plugin handles date and time parsing for posts. It ensures consistent datetime handling by converting various date formats to timezone-aware datetime…", "tags": []}, {"slug": "markata/plugins/create-covers", "title": "create_covers.py", "description": "The plugin is a simplified version of the covers plugin. It generates basic cover images with titles using a single template and font configuration.…", "tags": []}, {"slug": "markata/plugins/seo", "title": "seo.py", "description": "manifest plugin", "tags": []}, {"slug": "markata/plugins/mdit-details", "title": "mdit_details.py", "description": "The plugin adds support for collapsible details/summary sections in markdown using the syntax. This is similar to HTML's element but with a more…", "tags": []}, {"slug": "markata/plugins/rss", "title": "rss.py", "description": "[DEPRECATED] The plugin is deprecated and will be removed in a future version. Please use instead, which provides more comprehensive feed generation…", "tags": []}, {"slug": "markata/plugins/render-markdown", "title": "render_markdown.py", "description": "The plugin converts markdown content to HTML. This plugin is essential for rendering markdown files loaded by the plugin. Installation This plugin is built-in…", "tags": []}, {"slug": "markata/plugins/icon-resize", "title": "icon_resize.py", "description": "The plugin automatically generates favicons in multiple sizes from a single source image. This ensures your site has appropriate icons for different devices…", "tags": []}, {"slug": "markata/plugins/prevnext", "title": "prevnext.py", "description": "The plugin adds previous and next navigation links to each post, allowing readers to easily navigate between related content. Installation This plugin is…", "tags": []}, {"slug": "markata/plugins/feeds", "title": "feeds.py", "description": "The plugin is used to create feed pages, which are lists of posts. The list is generated using a , then each post in the list is rendered with a before being…", "tags": []}, {"slug": "markata/plugins/docs", "title": "docs.py", "description": "The plugin automatically generates documentation pages from Python source code docstrings. It parses Python files, extracts docstrings and code structure, and…", "tags": []}, {"slug": "markata/plugins/jinja-md", "title": "jinja_md.py", "description": "The plugin enables Jinja2 templating within your markdown content. This allows you to dynamically generate content using Python expressions and access to the…", "tags": []}, {"slug": "markata/plugins/auto-title", "title": "auto_title.py", "description": "The plugin automatically generates titles for posts that don't have a title specified in their frontmatter. It uses the filename to create a human-readable…", "tags": []}, {"slug": "markata/plugins/analytics", "title": "analytics.py", "description": "The plugin generates analytics and contribution visualizations for your Markata site. It creates a contributions heatmap similar to GitHub's contribution…", "tags": []}, {"slug": "markata/plugins/publish-html", "title": "publish_html.py", "description": "The plugin handles saving rendered HTML content to files. It determines the output path for each article and ensures files are saved in the correct location…", "tags": []}, {"slug": "markata/plugins/create-models", "title": "create_models.py", "description": "The plugin dynamically creates Markata's core Pydantic models by combining model fragments from various plugins. This enables extensible and type-safe data…", "tags": []}, {"slug": "markata/plugins/flat-slug", "title": "flat_slug.py", "description": "The plugin handles URL slug generation for your articles. It sanitizes special characters that don't work in browsers and provides a consistent URL structure.…", "tags": []}, {"slug": "markata/plugins/base-cli", "title": "base_cli.py", "description": "The plugin provides Markata's core command-line interface functionality, including essential commands like , , and . Installation This plugin is built-in and…", "tags": []}, {"slug": "markata/plugins/redirects", "title": "redirects.py", "description": "The plugin creates static redirects for your site using a simple configuration file. Compatible with services like Cloudflare Pages and Netlify. Installation…", "tags": []}, {"slug": "markata/plugins/heading-link", "title": "heading_link.py", "description": "The plugin adds clickable link icons next to headings in your HTML output. This makes it easy for readers to share direct links to specific sections of your…", "tags": []}, {"slug": "markata/plugins/manifest", "title": "manifest.py", "description": "The plugin generates a Web App Manifest (manifest.json) file for your site. This enables Progressive Web App (PWA) features and provides metadata for mobile…", "tags": []}, {"slug": "markata/plugins/didyoumean", "title": "didyoumean.py", "description": "DidYouMean Plugin for Markata Automatically generates redirect pages for URLs that may be mistyped by users. Installation Configuration Usage This plugin will…", "tags": []}, {"slug": "markata/plugins/post-template", "title": "post_template.py", "description": "The plugin handles the rendering of posts using Jinja2 templates. It provides extensive configuration options for HTML head elements, styling, and template…", "tags": []}, {"slug": "markata/plugins/md-it-wikilinks", "title": "md_it_wikilinks.py", "description": "The plugin adds support for wiki-style links using double brackets ( ). It automatically resolves links to other posts in your site using file names or slugs.…", "tags": []}, {"slug": "markata/plugins/pyinstrument", "title": "pyinstrument.py", "description": "The plugin adds performance profiling capabilities using pyinstrument. It generates detailed HTML reports showing where your build spends time. Installation…", "tags": []}, {"slug": "markata/plugins/config-model", "title": "config_model.py", "description": "The plugin defines Markata's core configuration model, providing validation and type safety for all configuration options. Installation This plugin is…", "tags": []}, {"slug": "markata/plugins/copy-assets", "title": "copy_assets.py", "description": "The plugin copies static assets (images, CSS, JavaScript, etc.) from your assets directory to the output directory during the build process. Installation This…", "tags": []}, {"slug": "markata/plugins/sitemap", "title": "sitemap.py", "description": "[DEPRECATED] The plugin is deprecated and will be removed in a future version. Please use instead, which provides more comprehensive sitemap generation…", "tags": []}, {"slug": "markata/cli/init", "title": "__init__.py", "description": "None", "tags": []}, {"slug": "markata/cli/main", "title": "__main__.py", "description": "None", "tags": []}, {"slug": "markata/cli/plugins", "title": "plugins.py", "description": "None", "tags": []}, {"slug": "markata/cli/runner", "title": "runner.py", "description": "None", "tags": []}, {"slug": "markata/cli/header", "title": "header.py", "description": "None", "tags": []}, {"slug": "markata/cli/cli", "title": "cli.py", "description": "None", "tags": []}, {"slug": "markata/cli/summary", "title": "summary.py", "description": "Run it Configuration There are two main things currently supported by summary, It can count the number of posts based on a filter ( grid_attr`). grid_attr…", "tags": []}, {"slug": "markata/cli/server", "title": "server.py", "description": "None", "tags": []}, {"slug": "markata/cli/didyoumean", "title": "didyoumean.py", "description": "dummy didyoumean page for testing didyoumean suggestions", "tags": []}, {"slug": "markata/scripts/migrate-to-slugify", "title": "migrate_to_slugify.py", "description": "Slugify migration for projects moving from markata<0.5.0 into markata>=0.5.0 to run this script install markata>=0.5.0 and run the following. Then make sure…", "tags": []}, {"slug": "markata/hookspec", "title": "hookspec.py", "description": "Markata's hook specification system for plugin development. Overview Markata uses pluggy to define hooks that plugins can implement. These hooks allow plugins…", "tags": []}, {"slug": "markata/errors", "title": "errors.py", "description": "None", "tags": []}, {"slug": "markata/init", "title": "__init__.py", "description": "Markata is a tool for handling directories of markdown.", "tags": []}, {"slug": "markata/standard-config", "title": "standard_config.py", "description": "Standard Config. A module to load tooling config from a users project space. Inspired from frustrations that some tools have a tool.ini, .tool.ini, setup.cfg,…", "tags": []}, {"slug": "markata/main", "title": "__main__.py", "description": "None", "tags": []}, {"slug": "markata/about", "title": "__about__.py", "description": "None", "tags": []}, {"slug": "markata/exceptions", "title": "exceptions.py", "description": "None", "tags": []}, {"slug": "markata/lifecycle", "title": "lifecycle.py", "description": "The LifeCycle is a core component for the internal workings of Markata. It sets fourth the hooks available, the methods to run them on the Markata instance,…", "tags": []}, {"slug": "test", "title": "test.py", "description": "None", "tags": []}, {"slug": "changelog", "title": "Changelog", "description": "Markata Changelog 0.11.0 Performance Improvements Perf: increased diskcache size limit to 5GB and reduced cull_limit to minimize expensive eviction operations…", "tags": []}, {"slug": "waylonwalker", "title": "WaylonWalker.com", "description": "Waylonwalker.com home page This Waylon Walker's personal blog where he is learning in public. Posting about topics such as linux, vim, python, and kedro.…", "tags": []}, {"slug": "markata-dev", "title": "Markata's Docs", "description": "Markta.dev home page Markata builds it's own docs in completely in using all built in templatates and plugins. Markta.dev home page Using the plugin it is…", "tags": []}, {"slug": "color-theme", "title": "Theming your markata site", "description": "Default colors The default markata page template support the following colors to be configured in the file. There are two sets of similarly named colors, one…", "tags": []}, {"slug": "index", "title": "Getting Started with Markata", "description": "Markata is a fully plugins all the way down static site generator for folks who just want their site to get started quickly and build great content, with the…", "tags": []}, {"slug": "multi-template", "title": "Using Multiple Templates", "description": "This page will be rendered multiple times. This is the normal page, check out title . It uses the og.html template. This is achieved through the use of the…", "tags": []}, {"slug": "nav", "title": "Creating your Navbar", "description": "Creating navbar links with the default markata templates is done by adding links in your configuration within a block. Example The following example will…", "tags": []}, {"slug": "admonitions", "title": "Admonitions", "description": "all of the admonitions", "tags": []}, {"slug": "create-manual", "title": "Manually create a new site", "description": "Markata has some templates that let you get up and running quickly, but you can make a site with only markdown if you wanted. Installation is hosted on pypi…", "tags": []}, {"slug": "404", "title": "Whoops that page was not found", "description": "404, looks like we can't find the page you are looking for. Try one of these pages.", "tags": []}, {"slug": "home-page", "title": "Creating your Home Page", "description": "There are several ways to create your home/landing page, lets walk through them. Default Behavior feed By default if there is no index page, the feed plugin…", "tags": []}]